# Data Loading, Storage, and File Formats

Topic Reading and Writing Data in Text Format
Parsing functions in pandas

read_csv = load delimited data from a file, URL, or file-like
object; use comma as default delimiter

read_excel = Read tabular data from an Excel XLS or XLSX file
read_html = Read all tables found in the given HTML document

# common options in these functions

# Indexing
Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, the user, or not at all.
# Type inference and data conversion
This includes the user-defined value conversions and custom list of missing value markers.
# Datetime parsing
Includes combining capability, including combining date and time information spread over multiple columns into a single column in the result.
# Iterating
Support for iterating over chunks of very large files.
# Unclean data issues
Skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.
download examples folder from our provide link or book resources

# Loading data into pandas data frame

In [1]:
import pandas as pd
import numpy as np

In [5]:
#sample_df = pd.read_csv("sample.csv")
#print(sample_df)
#what if no column name available (we are removing first row)

sample_df = pd.read_csv ("sample.csv")
print(sample_df)
print("\n")

sample_df = pd.read_csv("sample.csv",skiprows = 1, names = ['id','name',' ch', 'Ph', 'En', 'Math'])
sample_df = pd.read_csv("sample.csv",header = None, names = ['id','name',' ch', 'Ph', 'En', 'Math'])


print(sample_df)

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80


          id         name          ch        Ph        En   Math
0  studentid         name   chimestry   physics   english   math
1        A01     arif ali          20        30        40     50
2        A02  kamran khan          30        40        50     60
3        A03   imran ali           40        50        60     70
4        A04  kashif khan          50        60        70     80

In [28]:
sample_df = pd.read_csv("examples/ex1.csv")
print(sample_df)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Hierarchal index

In [18]:
s2_Df = pd.read_csv("examples/sample2.csv")
#print(s2_Df)
parsed = pd.read_csv("examples/sample2.csv",index_col = ['key1','key2'])
df = pd.DataFrame(parsed)
sp = pd.Series(df['value1'])
display(df.index)
display(sp)

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('one', 'c'),
            ('one', 'd'),
            ('two', 'a'),
            ('two', 'b'),
            ('two', 'c'),
            ('two', 'd')],
           names=['key1', 'key2'])

key1  key2
one   a        1
      b        3
      c        5
      d        7
two   a        9
      b       11
      c       13
      d       15
Name: value1, dtype: int64

# Handling Missing Value

In [64]:
result = pd.read_csv("examples/sample3.csv")
print(result)
#result = pd.read_csv('examples/sample3.csv', na_values=['NULL'])
#print(result)
#changing data while loading in dataframe
#dictionary = column name : [Source Values, traget Value]
sentinels = {'message' : ['foo','NA']}
pd.read_csv('examples/sample3.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# Reading and Text Files in Pieces

In [69]:
#Extracting Selected row from datasets
pd.read_csv("datasets/train.csv",nrows=200)

In [17]:
chunks = pd.read_csv("datasets/train.csv", chunksize=200)
#print(type(chunks), print(chunks))
chunkList = []
for chunk in chunks:
        chunkList.append(chunk)
df_0 = chunkList[0]
print(df_0)

     battery_power  blue  clock_speed  dual_sim  fc  four_g  int_memory  \
0              842     0          2.2         0   1       0           7
1             1021     1          0.5         1   0       1          53
2              563     1          0.5         1   2       1          41
3              615     1          2.5         0   0       0          10
4             1821     1          1.2         0  13       1          44
..             ...   ...          ...       ...  ..     ...         ...
195           1526     0          2.1         0   1       1          23
196           1989     0          2.5         1   0       1          41
197           1308     0          1.9         0   0       1          61
198            609     0          0.5         0   3       0          26
199           1905     0          0.6         1   9       1          36

     m_dep  mobile_wt  n_cores  ...  px_height  px_width   ram  sc_h  sc_w  \
0      0.6        188        2  ...         20       756  2549     9     7
1      0.7        136        3  ...        905      1988  2631    17     3
2      0.9        145        5  ...       1263      1716  2603    11     2
3      0.8        131        6  ...       1216      1786  2769    16     8
4      0.6        141        2  ...       1208      1212  1411     8     2
..     ...        ...      ...  ...        ...       ...   ...   ...   ...
195    0.2        117        7  ...        718       751  2227    18    10
196    0.8         94        3  ...       1100      1497  1665    17     9
197    0.7        106        3  ...         59      1215  3355    15     2
198    0.3         93        4  ...        938      1948  1866    11    10
199    0.4        119        3  ...        825      1542  1287    13     4

     talk_time  three_g  touch_screen  wifi  price_range
0           19        0             0     1            1
1            7        1             1     0            2
2            9        1             1     0            2
3           11        1             0     0            2
4           15        1             1     0            1
..         ...      ...           ...   ...          ...
195          3        1             1     0            2
196         12        1             1     1            2
197          4        1             0     1            3
198         14        1             1     1            1
199         16        1             0     0            1

[200 rows x 21 columns]

In [84]:
data = list(open('examples/ex3.txt'))
print(data)
#use spaces (one or more) as delimiter
result = pd.read_table('examples/ex3.txt', sep = '\s+')
result

['            A         B         C\n', 'aaa -0.264438 -1.026059 -0.619500\n', 'bbb  0.927272  0.302904 -0.032399\n', 'ccc -0.264273 -0.386314 -0.217601\n', 'ddd -0.871858 -0.348382  1.100491\n']

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [109]:
df1 = pd.read_csv('examples/ex4.csv')
df = pd.read_csv('examples/ex4.csv', skiprows=[0, 5 , 4 ])
print(df1)
print("\n")
print(df)

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo


                                                   a         b     c     d  \
0  # just wanted to make things more difficult fo...       NaN   NaN   NaN
1               # who reads CSV files with computers   anyway?   NaN   NaN
2                                                  9        10  11.0  12.0

  message
0     NaN
1     NaN
2     foo

In [ ]:
# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

# Writing Data to Text Format

In [112]:
data = pd.read_csv('examples/ex5.csv')
print(data)
data.to_csv('examples/out.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
import numpy as np
dates = pd.date_range('1/1/2000', periods= 8 )
print(dates)
ts = pd.Series(np.arange(8), index=dates)
ts.to_csv('examples/tseries.csv')
print(ts)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')
2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
2000-01-08    7
Freq: D, dtype: int32

# Working with Delimited Formats

In [22]:
import csv
files = open('examples/ex7.csv')
reader = csv.reader(files)
#print(reader)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

# JSON DATA
short for javaScript Object Notation

In [125]:
# Same Like Dictionary
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
#print(obj)
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# XML and HTML: Web Data Loading in to DataFrame

In [6]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
#tables variable type is not dataframe instead its a list
print(type(tables))
print(len(tables))
failures_df = tables[0]
type(failures_df)
#print(type(failures_df))
#print(failures_df)
#print(failures_df.shape)
#print(failures_df.columns)
#len(failures_df)
#print(failures_df["City"].head())
#print(failures_df["Bank Name"].head())
#print(failures_df.head())

<class 'list'>
1

pandas.core.frame.DataFrame

In [146]:
# for large and complicated dataframe, try to extract data
# as Series for review and analysis
#here we converted a column into new Series of data type
close_timestamps = pd.to_datetime(failures_df['Closing Date'])
print(type(close_timestamps),"\n\n",close_timestamps)

<class 'pandas.core.series.Series'>

 0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

# Binary Data Formats

In [149]:
frame = pd.read_csv('examples/ex1.csv')
df = frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Using HDF5 Format

In [30]:
frame = pd.DataFrame({'a': np.random.rand(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
#print(store)
x = store.obj1
#print(type(x))
#print(x.head())
print("-----------------------------")
store.put('obj2', frame, format = 'table')
store.select('obj2', where = ['index >= 10 and index <= 15'])
y = store.obj2
#print("Y",y)
store.close()
#frame.to_hdf('mydata.h5','obj3', format = 'table')
frame = pd.read_hdf('mydata.h5', 'obj3', where=['index < 500'])
print(frame)

-----------------------------
           a
0   0.613495
1   0.836170
2   0.950408
3   0.144442
4   0.116958
..       ...
95  0.924441
96  0.257553
97  0.518457
98  0.277741
99  0.319794

[100 rows x 1 columns]

# Reading from Excel File

In [165]:
#reading 
xlsx = pd.ExcelFile('examples/ex1.xlsx')
frame = pd.read_excel('examples/ex1.xlsx','Sheet1')
#writing
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()
#alternative option for single sheet
frame.to_excel('examples/ex2.xlsx')

In [3]:
import requests 

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
#print(resp)
data = resp.json()
#print(type(data))
#print(data[0])
type(resp)

requests.models.Response

In [36]:
data_dict = data[0]
#print(data_dict['title'])
issues = pd.DataFrame(data, columns=['number','title', 'labels', 'state'])
display(issues.head())
#print(issues[['number', 'title']].head())

   number                                              title  \
0   43836  ENH: Should  `pandas.CategoricalDtype` use `pa...
1   43835  ENH: rolling()  for  discontinued time series ...
2   43834                   TYP: Fix typing of frame.explode
3   43833     update fix ignored sort in api.py and add test
4   43831  BUG: using 2 character seperator in pd.json_no...

                                              labels state
0  [{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...  open
1  [{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...  open
2  [{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...  open
3                                                 []  open
4  [{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...  open

# Interacting with Databases

In [39]:
#conda install -c anaconda sqlite
import sqlite3

#creating table 
query = """ CREATE TABLE test(a VARCHAR(20),
            b VARCHAR(20),
            c REAL,
            d INTEGER); """
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

OperationalError: table test already exists

In [40]:
# inserting data 
data = [('Atlanta', 'Georgia',1.25,6),
       ('Tallahassee','Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [41]:
#selecting./extracting data
cursor = con.execute('select * from test')
row = cursor.fetchall()
display(row, type(row))

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

list

In [42]:
#print(cursor.description)
data_df = pd.DataFrame(row, columns=[x[0] for x in cursor.description])
print(data_df)

(('a', None, None, None, None, None, None), ('b', None, None, None, None, None, None), ('c', None, None, None, None, None, None), ('d', None, None, None, None, None, None))
             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5
6      Atlanta     Georgia  1.25  6
7  Tallahassee     Florida  2.60  3
8   Sacramento  California  1.70  5

In [2]:
#conda install -c anaconda sqlalchemy

In [8]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5